{
    "news" : [{
        "id": 1,
        "img": "https://english.sakshi.com/sites/default/files/styles/storypage_main/public/article_images/2022/04/27/salaar-1651038553.jpg?itok=BkffZr6m",
        "headline": "Prashanth Neel Budget For Prabhas' Salaar Interval Scene Will Stun You",
        "desc": "The latest news doing the rounds is that the makers of Salaar are spending a whopping amount, to the tune of Rs 20 cr on an action sequence around interval.",
        "article": "Finally, Rebel star Prabhas is back in action after a month's break following his latest release, RadheShyam. Prabhas was mighty disappointed over Radhe Shyam's dismal show at the box office. The film turned out to be a big disaster in his career. Putting everything aside, Tollywood actor Prabhas is back on the sets of his next movie, Salaar whisch is being helmed by Prashanth Neel of KGF fame. The latest news doing the rounds is that the makers of Salaar are spending a whopping amount, to the tune of Rs 20 cr on an action sequence around interval. The scene is going to be a major highlight of the movie, it is being said. Salaar makers are pretty confident about the film.  Salaar is going to created a bigger impact than the director's recently released KGF franchise. Will Salaar be able to get bigger than KGF franchise remains to be seen. Salaar is produced by Vijay Kiragandur under the banner, Hombale Films. Salaar will be released in multiple languages. Apart from Prabhas, the film features Prithviraj Sukumaran, Shruti Haasan, and Jagapathi Babu in key roles. Salaar is slated for a grand theatrical release sometime in 2023.",
        "url": "https://english.sakshi.com/news/tollywood/prashanth-neel-budget-prabhas-salaar-interval-scene-will-stun-you-154227",
        "genre" : "movies",
        "source" : "sakshi.com",
        "publishedDate" : "2022-04-27T11:19:13+05:30",
        "source-url" : "https://english.sakshi.com/"
    },
    {
        "id": 2,
        "img": "https://static.toiimg.com/thumb/msid-91073669,imgsize-42918,width-400,resizemode-4/91073669.jpg",
        "headline": "IPL 2022: MS Dhoni is the ultimate finisher, says Irfan Pathan", 
        "desc": "Appreciation for Dhoni the finisher has continued to pour in after he won the game for Chennai Super Kings against Mumbai.",
        "article": "Speaking on Star Sports, Pathan said, MS Dhoni is the greatest finisher in the history of IPL. Year after year, someone else has been joining this list but no one has been able to displace Dhoni. He is the identity of this league, its true ambassador. MSD and AB de Villiers have been the biggest finishers in the history of IPL, but Dhoni is at the forefront of it. He is the greatest. If we talk about this season, it is pertinent to mention the names of Rahul Tewatia, Dinesh Karthik, Shimron Hetmyer because they have been finishing the games continuously for their teams. But when it comes to the ultimate finisher, obviously only one name will come to mind and that is Dhoni's, said Pathan. Pathan also claimed that despite languishing at the bottom half of the points table, no team can still take Chennai Super Kings lightly for the defending champions know how to win games from the worst of situations. No team can make the mistake of underestimating CSK. This is a team which knows how to snatch victory from the jaws of defeat. This team has done it many times and that is why it has always been the most dangerous of sides in the history of the league, said Pathan.",
        "url" : "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2022-ms-dhoni-is-the-ultimate-finisher-says-irfan-pathan/articleshow/91073593.cms",
        "genre" : "sports",
        "source" : "timesofindia.com",
        "publishedDate" : "2022-04-25T16:24:26.000Z",
        "source-url" : "https://timesofindia.indiatimes.com/us"
    },
    {
        "id": 3,
        "img": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/95847bac-3ad1-4176-bfac-732d07b42648.jpg",
        "headline": "Ukrainian president says missiles struck Kyiv while UN chief was visiting", 
        "desc": "Ukrainian officials have condemned Russia’s missile attack on Kyiv Thursday night, which occurred as the United Nations Secretary-General Antonio Guterres was finishing a visit to the Ukrainian capital. ",
        "article": "President Volodymyr Zelensky, in his daily video message, said that Today, immediately after the end of our talks [with Guterres] in Kyiv, Russian missiles flew into the city. 5 missiles. This says a lot about Russia's true attitude to global institutions, about the Russian leadership's efforts to humiliate the UN and everything that the organization represents. And therefore requires an appropriate, powerful response. Russian missile strikes on Ukraine — on Kyiv, Fastiv, Odesa, Khmelnytskyi and other cities — prove once again that one cannot relax yet, one cannot think that the war is over. We still need to fight, we need to drive the occupiers out, Zelensky saidThe Ukrainian Prime Minister, Denys Shmyhal, said in a tweet: “During the meeting with @antonioguterres in Kyiv, we heard explosions. Russia launched a missile strike on the capital. I am sure that such defiant behavior of the occupier will be assessed properly by the UN Secretary-General. War in #Ukraine is an attack on world security!",
        "url" : "https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-04-28-22/h_eb11f7ada69f4f85897cfca1b2b9d725",
        "genre" : "international",
        "source" : "cnn.com",
        "publishedDate" : "2022-04-28T04:01:02Z",
        "source-url" : "https://edition.cnn.com/"
    },
    {
        "id": 4,
        "img": "https://i.cbc.ca/1.6429828.1650892723!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/musk-solarcity.jpg",
        "headline": "Tesla shares plunge 12% as investors wary of Elon Musk's Twitter plan", 
        "desc": "Shares in electric car maker Tesla sold off heavily a day after it was revealed that company CEO Elon Musk would be leading a $44-billion US buyout of Twitter.",
        "article": "The value of Tesla fell by more than $100 billion US on Tuesday as investors digested news that the company's CEO may have to sell part of his stake in the company to buy Twitter — and will likely be distracted from his day job while he does. Shares in the electric car maker lost 12 per cent of their value to close at $876.42 on the Nasdaq on Tuesday, down by more than $120 US from Monday's level and the worst one-day showing for the company since January. While Tesla shares have been on a tear along with Elon Musk and his rising fame in recent years, they've lost almost a quarter of their value since their CEO's dalliance with Twitter first came to light earlier this month. Musk owns more than 173 million shares in Tesla, about one-sixth of the electric car maker company which has a market value of just shy of $1 trillion US after Tuesday's fall. His Tesla stake is valued at more than $150 billion US, a big part of what makes Musk the richest person in the world, but he has used about $60 billion worth of his Tesla shares as collateral for loans. Since Musk's minority stake in Twitter was revealed earlier this month, the dollar value of Musk's stake in Tesla has declined by more than what he has offered to pay for the social media company.",
        "url" : "https://www.cbc.ca/news/business/tesla-twitter-musk-shares-1.6431692#:~:text=Business-,Tesla%20shares%20plunge%2012%25%20as%20investors%20wary%20of%20Elon%20Musk's,day%20job%20while%20he%20does.",
        "genre" : "business",
        "source" : "cbc.ca",
        "publishedDate" : "2022-04-27T13:58:11.821Z",
        "source-url" : "https://www.cbc.ca/"
    },
    {
        "id": 5,
        "img": "https://static01.nyt.com/images/2022/04/27/business/27facebook-earnings/merlin_202628490_373686d1-b6f5-47ce-a566-d7da7a614af4-jumbo.jpg?quality=75&auto=webp",
        "headline": "Meta, Facebook’s parent, reports a 21 percent drop in profits.", 
        "desc": "Meta reported profit of $7.5 billion for the first quarter on revenue of $27.9 billion. The next day, Meta’s stock plummeted 26 percent and its market value plunged more than $230 billion in the company’s biggest one-day wipeout ever.",
        "article": "Mark Zuckerberg, the founder of Facebook, has staked his company’s future on an immersive online world known as the metaverse. On Wednesday, the company showed it was still navigating that transformation. Meta, the company formerly known as Facebook, reported profit of $7.5 billion for the first quarter, down 21 percent from a year earlier. Revenue rose 7 percent to $27.9 billion. Wall Street analysts had predicted profits of $7.1 billion on revenue of $28.2 billion. The results followed Meta’s dismal financial report in February, when the company also posted falling profits and slowing user growth. The next day, Meta’s stock plummeted 26 percent and its market value plunged more than $230 billion in the company’s biggest one-day wipeout ever. The two quarters were the company’s first back-to-back profit declines in over a decade, a sign of the difficulties it is encountering as it changes course. While Meta is spending heavily on metaverse-related products like virtual-reality goggles, whether people want to buy such gadgets remains far from certain. At the same time, the company’s core social networking apps — including Instagram, WhatsApp and Messenger — face challenges. New-user growth has slowed, and competition from rivals like TikTok, the Chinese-owned video site, is increasing. In a statement on Wednesday, Mr. Zuckerberg said he was sticking by the metaverse plan. “We remain confident in the long-term opportunities and growth that our product road map will unlock,” he said. Meta’s main business of digital advertising has been hurt by Apple’s decision to let iPhone users limit apps from tracking their online activities. That change has affected Meta’s ability to target ads to people on iPhones. Google has also discussed introducing similar privacy changes to its mobile products, which could further affect Meta’s ad business. In March, Russia banned Facebook and Instagram after its invasion of Ukraine, leading to losses of tens of millions of users,",
        "url" : "https://www.nytimes.com/2022/04/27/technology/facebook-meta-earnings.html#:~:text=Meta%2C%20the%20company%20formerly%20known,on%20revenue%20of%20%2428.2%20billion.",
        "genre" : "business",
        "source" : "nytimes.com",
        "publishedDate" : "2022-04-27T22:41:59.000Z",
        "source-url" : "https://www.nytimes.com/"
    },
    {
        "id": 6,
        "img": "https://s.hdnux.com/photos/01/22/57/34/21690159/18/1200x0.jpg",
        "headline": "West Haven council advances 3 rescue plan funding proposals for bidding", 
        "desc": "WEST HAVEN — The City Council took its first steps toward spending federal American Rescue Plan Act funding this week, voting to seek bids for hunger, sidewalk and stormwater management improvement projects.",
        "article": "The vote at Monday’s City Council meeting was not to expend any of the city’s $29 million allocation of ARPA funding, but to task the volunteer ARPA Committee with finding contractors who can perform the requested services within the suggested budget. The projects, which came from Mayor Nancy Rossi’s plan, are to spend $400,000 on food and clothing bank programs to address hunger and food insecurity in the elderly and youth population; $250,000 for sidewalk and crosswalk improvements near school and youth facilities; and a vacuum truck to address stormwater runoff in a more affordable way for the city. The council passed a resolution last year that it must approve all expenditures of ARPA funding after a former City Hall employee entrusted to manage the $1.15 million federal CARES Act was federally indicted for wire fraud after allegedly using fraudulent invoices to shift much of the grant into a shell company’s bank account. Former state Rep. Michael DiMassa, who worked as an administrative assistant in City Hall, received approval from the City Council in December 2020 to act as a mayoral designee to manage the CARES Act funds. Both the CARES Act and ARPA funding are federal grants intended to provide relief and economic recovery for municipalities from the COVID-19 pandemic. The U.S. Treasury has determined that ARPA funds must be fully obligated to specific expenses by Dec. 31, 2024, and must be spent by Dec. 31, 2026.",
        "url" : "https://www.nhregister.com/news/article/West-Haven-council-advances-3-rescue-plan-funding-17134499.php",
        "genre" : "local",
        "source" : "nhregister.com",
        "publishedDate" : "2022-04-29T06:00:26.000Z",
        "source-url" : "https://www.nhregister.com/"
    }
    ]
}